zephyrproject-rtos/hal_nxp/dts/nxp/imxrt/imxrt7xx/pinctrl/MIMXRT798SGFOB-pinctrl.h
#define GPIO10_GPIO0_PIO10_0 IOPCTL_MUX(1, 64, 0) /* PIO10_0 */
#define PDM_CLK_PIO10_0 IOPCTL_MUX(1, 64, 5) /* PIO10_0 */
#define PINT1_PINT0_PIO10_0 IOPCTL_MUX(1, 64, 0) /* PIO10_0 */
#define PINT1_PINT1_PIO10_0 IOPCTL_MUX(1, 64, 0) /* PIO10_0 */
#define PINT1_PINT2_PIO10_0 IOPCTL_MUX(1, 64, 0) /* PIO10_0 */
#define PINT1_PINT3_PIO10_0 IOPCTL_MUX(1, 64, 0) /* PIO10_0 */
#define ADC0_CH18_PIO10_1 IOPCTL_MUX(1, 65, 0) /* PIO10_1 */
#define GPIO10_GPIO1_PIO10_1 IOPCTL_MUX(1, 65, 0) /* PIO10_1 */
#define PDM_DATA0_PIO10_1 IOPCTL_MUX(1, 65, 5) /* PIO10_1 */
#define PINT1_PINT0_PIO10_1 IOPCTL_MUX(1, 65, 0) /* PIO10_1 */
#define PINT1_PINT1_PIO10_1 IOPCTL_MUX(1, 65, 0) /* PIO10_1 */
#define PINT1_PINT2_PIO10_1 IOPCTL_MUX(1, 65, 0) /* PIO10_1 */
#define PINT1_PINT3_PIO10_1 IOPCTL_MUX(1, 65, 0) /* PIO10_1 */
#define ADC0_CH1_PIO10_2 IOPCTL_MUX(1, 66, 0) /* PIO10_2 */
#define GPIO10_GPIO2_PIO10_2 IOPCTL_MUX(1, 66, 0) /* PIO10_2 */
#define PDM_DATA1_PIO10_2 IOPCTL_MUX(1, 66, 5) /* PIO10_2 */
#define PINT1_PINT0_PIO10_2 IOPCTL_MUX(1, 66, 0) /* PIO10_2 */
#define PINT1_PINT1_PIO10_2 IOPCTL_MUX(1, 66, 0) /* PIO10_2 */
#define PINT1_PINT2_PIO10_2 IOPCTL_MUX(1, 66, 0) /* PIO10_2 */
#define PINT1_PINT3_PIO10_2 IOPCTL_MUX(1, 66, 0) /* PIO10_2 */
#define ADC0_CH19_PIO10_3 IOPCTL_MUX(1, 67, 0) /* PIO10_3 */
#define GPIO10_GPIO3_PIO10_3 IOPCTL_MUX(1, 67, 0) /* PIO10_3 */
#define PDM_DATA2_PIO10_3 IOPCTL_MUX(1, 67, 5) /* PIO10_3 */
#define PINT1_PINT0_PIO10_3 IOPCTL_MUX(1, 67, 0) /* PIO10_3 */
#define PINT1_PINT1_PIO10_3 IOPCTL_MUX(1, 67, 0) /* PIO10_3 */
#define PINT1_PINT2_PIO10_3 IOPCTL_MUX(1, 67, 0) /* PIO10_3 */
#define PINT1_PINT3_PIO10_3 IOPCTL_MUX(1, 67, 0) /* PIO10_3 */
#define ADC0_CH2_PIO10_4 IOPCTL_MUX(1, 68, 0) /* PIO10_4 */
#define GPIO10_GPIO4_PIO10_4 IOPCTL_MUX(1, 68, 0) /* PIO10_4 */
#define PDM_DATA3_PIO10_4 IOPCTL_MUX(1, 68, 5) /* PIO10_4 */
#define PINT1_PINT0_PIO10_4 IOPCTL_MUX(1, 68, 0) /* PIO10_4 */
#define PINT1_PINT1_PIO10_4 IOPCTL_MUX(1, 68, 0) /* PIO10_4 */
#define PINT1_PINT2_PIO10_4 IOPCTL_MUX(1, 68, 0) /* PIO10_4 */
#define PINT1_PINT3_PIO10_4 IOPCTL_MUX(1, 68, 0) /* PIO10_4 */
#define ADC0_CH20_PIO10_5 IOPCTL_MUX(1, 69, 0) /* PIO10_5 */
#define CMP0_OUT_PIO10_5 IOPCTL_MUX(1, 69, 3) /* PIO10_5 */
#define GPIO10_GPIO5_PIO10_5 IOPCTL_MUX(1, 69, 0) /* PIO10_5 */
#define PINT1_PINT0_PIO10_5 IOPCTL_MUX(1, 69, 0) /* PIO10_5 */
#define PINT1_PINT1_PIO10_5 IOPCTL_MUX(1, 69, 0) /* PIO10_5 */
#define PINT1_PINT2_PIO10_5 IOPCTL_MUX(1, 69, 0) /* PIO10_5 */
#define PINT1_PINT3_PIO10_5 IOPCTL_MUX(1, 69, 0) /* PIO10_5 */
#define GPIO10_GPIO6_PIO10_6 IOPCTL_MUX(1, 70, 0) /* PIO10_6 */
#define PINT1_PINT0_PIO10_6 IOPCTL_MUX(1, 70, 0) /* PIO10_6 */
#define PINT1_PINT1_PIO10_6 IOPCTL_MUX(1, 70, 0) /* PIO10_6 */
#define PINT1_PINT2_PIO10_6 IOPCTL_MUX(1, 70, 0) /* PIO10_6 */
#define PINT1_PINT3_PIO10_6 IOPCTL_MUX(1, 70, 0) /* PIO10_6 */
#define SDADC_INP0_PIO10_6 IOPCTL_MUX(1, 70, 0) /* PIO10_6 */
#define GPIO10_GPIO7_PIO10_7 IOPCTL_MUX(1, 71, 0) /* PIO10_7 */
#define PINT1_PINT0_PIO10_7 IOPCTL_MUX(1, 71, 0) /* PIO10_7 */
#define PINT1_PINT1_PIO10_7 IOPCTL_MUX(1, 71, 0) /* PIO10_7 */
#define PINT1_PINT2_PIO10_7 IOPCTL_MUX(1, 71, 0) /* PIO10_7 */
#define PINT1_PINT3_PIO10_7 IOPCTL_MUX(1, 71, 0) /* PIO10_7 */
#define SDADC_INN0_PIO10_7 IOPCTL_MUX(1, 71, 0) /* PIO10_7 */
#define ACMP0_IN1_PIO10_8 IOPCTL_MUX(1, 72, 0) /* PIO10_8 */
#define GPIO10_GPIO8_PIO10_8 IOPCTL_MUX(1, 72, 0) /* PIO10_8 */
#define PDM_CLK_PIO10_8 IOPCTL_MUX(1, 72, 5) /* PIO10_8 */
#define PINT1_PINT0_PIO10_8 IOPCTL_MUX(1, 72, 0) /* PIO10_8 */
#define PINT1_PINT1_PIO10_8 IOPCTL_MUX(1, 72, 0) /* PIO10_8 */
#define PINT1_PINT2_PIO10_8 IOPCTL_MUX(1, 72, 0) /* PIO10_8 */
#define PINT1_PINT3_PIO10_8 IOPCTL_MUX(1, 72, 0) /* PIO10_8 */
#define ACMP0_IN2_PIO10_9 IOPCTL_MUX(1, 73, 0) /* PIO10_9 */
#define GPIO10_GPIO9_PIO10_9 IOPCTL_MUX(1, 73, 0) /* PIO10_9 */
#define PDM_DATA0_PIO10_9 IOPCTL_MUX(1, 73, 5) /* PIO10_9 */
#define PINT1_PINT0_PIO10_9 IOPCTL_MUX(1, 73, 0) /* PIO10_9 */
#define PINT1_PINT1_PIO10_9 IOPCTL_MUX(1, 73, 0) /* PIO10_9 */
#define PINT1_PINT2_PIO10_9 IOPCTL_MUX(1, 73, 0) /* PIO10_9 */
#define PINT1_PINT3_PIO10_9 IOPCTL_MUX(1, 73, 0) /* PIO10_9 */
#define ADC0_CH4_PIO10_12 IOPCTL_MUX(1, 76, 0) /* PIO10_12 */
#define GPIO10_GPIO12_PIO10_12 IOPCTL_MUX(1, 76, 0) /* PIO10_12 */
#define PDM_DATA3_PIO10_12 IOPCTL_MUX(1, 76, 5) /* PIO10_12 */
#define PINT1_PINT0_PIO10_12 IOPCTL_MUX(1, 76, 0) /* PIO10_12 */
#define PINT1_PINT1_PIO10_12 IOPCTL_MUX(1, 76, 0) /* PIO10_12 */
#define PINT1_PINT2_PIO10_12 IOPCTL_MUX(1, 76, 0) /* PIO10_12 */
#define PINT1_PINT3_PIO10_12 IOPCTL_MUX(1, 76, 0) /* PIO10_12 */
#define SDADC_INP1_PIO10_12 IOPCTL_MUX(1, 76, 0) /* PIO10_12 */
#define ADC0_CH22_PIO10_13 IOPCTL_MUX(1, 77, 0) /* PIO10_13 */
#define GPIO10_GPIO13_PIO10_13 IOPCTL_MUX(1, 77, 0) /* PIO10_13 */
#define PDM_CLK_PIO10_13 IOPCTL_MUX(1, 77, 5) /* PIO10_13 */
#define PINT1_PINT0_PIO10_13 IOPCTL_MUX(1, 77, 0) /* PIO10_13 */
#define PINT1_PINT1_PIO10_13 IOPCTL_MUX(1, 77, 0) /* PIO10_13 */
#define PINT1_PINT2_PIO10_13 IOPCTL_MUX(1, 77, 0) /* PIO10_13 */
#define PINT1_PINT3_PIO10_13 IOPCTL_MUX(1, 77, 0) /* PIO10_13 */
#define SDADC_INN1_PIO10_13 IOPCTL_MUX(1, 77, 0) /* PIO10_13 */
#define ADC0_CH5_PIO10_14 IOPCTL_MUX(1, 78, 0) /* PIO10_14 */
#define GPIO10_GPIO14_PIO10_14 IOPCTL_MUX(1, 78, 0) /* PIO10_14 */
#define PDM_DATA0_PIO10_14 IOPCTL_MUX(1, 78, 5) /* PIO10_14 */
#define PINT1_PINT0_PIO10_14 IOPCTL_MUX(1, 78, 0) /* PIO10_14 */
#define PINT1_PINT1_PIO10_14 IOPCTL_MUX(1, 78, 0) /* PIO10_14 */
#define PINT1_PINT2_PIO10_14 IOPCTL_MUX(1, 78, 0) /* PIO10_14 */
#define PINT1_PINT3_PIO10_14 IOPCTL_MUX(1, 78, 0) /* PIO10_14 */
#define SDADC_INP2_PIO10_14 IOPCTL_MUX(1, 78, 0) /* PIO10_14 */
#define ADC0_CH0_PIO10_15 IOPCTL_MUX(1, 79, 0) /* PIO10_15 */
#define GPIO10_GPIO15_PIO10_15 IOPCTL_MUX(1, 79, 0) /* PIO10_15 */
#define PDM_DATA1_PIO10_15 IOPCTL_MUX(1, 79, 5) /* PIO10_15 */
#define PINT1_PINT0_PIO10_15 IOPCTL_MUX(1, 79, 0) /* PIO10_15 */
#define PINT1_PINT1_PIO10_15 IOPCTL_MUX(1, 79, 0) /* PIO10_15 */
#define PINT1_PINT2_PIO10_15 IOPCTL_MUX(1, 79, 0) /* PIO10_15 */
#define PINT1_PINT3_PIO10_15 IOPCTL_MUX(1, 79, 0) /* PIO10_15 */
#define SDADC_INN2_PIO10_15 IOPCTL_MUX(1, 79, 0) /* PIO10_15 */
#define ACMP0_IN3_PIO10_16 IOPCTL_MUX(1, 80, 0) /* PIO10_16 */
#define GPIO10_GPIO16_PIO10_16 IOPCTL_MUX(1, 80, 0) /* PIO10_16 */
#define PDM_DATA2_PIO10_16 IOPCTL_MUX(1, 80, 5) /* PIO10_16 */
#define PINT1_PINT0_PIO10_16 IOPCTL_MUX(1, 80, 0) /* PIO10_16 */
#define PINT1_PINT1_PIO10_16 IOPCTL_MUX(1, 80, 0) /* PIO10_16 */
#define PINT1_PINT2_PIO10_16 IOPCTL_MUX(1, 80, 0) /* PIO10_16 */
#define PINT1_PINT3_PIO10_16 IOPCTL_MUX(1, 80, 0) /* PIO10_16 */
#define SDADC_INP3_PIO10_16 IOPCTL_MUX(1, 80, 0) /* PIO10_16 */
#define ACMP0_IN4_PIO10_17 IOPCTL_MUX(1, 81, 0) /* PIO10_17 */
#define GPIO10_GPIO17_PIO10_17 IOPCTL_MUX(1, 81, 0) /* PIO10_17 */
#define PDM_DATA3_PIO10_17 IOPCTL_MUX(1, 81, 5) /* PIO10_17 */
#define PINT1_PINT0_PIO10_17 IOPCTL_MUX(1, 81, 0) /* PIO10_17 */
#define PINT1_PINT1_PIO10_17 IOPCTL_MUX(1, 81, 0) /* PIO10_17 */
#define PINT1_PINT2_PIO10_17 IOPCTL_MUX(1, 81, 0) /* PIO10_17 */
#define PINT1_PINT3_PIO10_17 IOPCTL_MUX(1, 81, 0) /* PIO10_17 */
#define SDADC_INN3_PIO10_17 IOPCTL_MUX(1, 81, 0) /* PIO10_17 */

#endif
